// https://leetcode-cn.com/problems/flipping-an-image/


// 示例 1：

// 输入：[[1,1,0],[1,0,1],[0,0,0]]
// 输出：[[1,0,0],[0,1,0],[1,1,1]]
// 解释：首先翻转每一行: [[0,1,1],[1,0,1],[0,0,0]]；
//      然后反转图片: [[1,0,0],[0,1,0],[1,1,1]]
// 示例 2：

// 输入：[[1,1,0,0],[1,0,0,1],[0,1,1,1],[1,0,1,0]]
// 输出：[[1,1,0,0],[0,1,1,0],[0,0,0,1],[1,0,1,0]]
// 解释：首先翻转每一行: [[0,0,1,1],[1,0,0,1],[1,1,1,0],[0,1,0,1]]；
//      然后反转图片: [[1,1,0,0],[0,1,1,0],[0,0,0,1],[1,0,1,0]]

/**
 * @param {number[][]} A
 * @return {number[][]}
 */
var flipAndInvertImage = function (A) {
    let m = A.length
    let n = A[0].length
    for (let i = 0; i < m; i++) {
        for (let j = 0; j < Math.floor(n / 2); j++) {
            let temp = A[i][j]
            A[i][j] = A[i][n - j - 1]
            A[i][n - j - 1] = temp

            A[i][j] = A[i][j] === 1 ? 0 : 1
            A[i][n - j - 1] =A[i][n - j - 1] === 1 ? 0 : 1
        }
        if (n % 2 !== 0) {
            A[i][Math.floor(n / 2)] = A[i][Math.floor(n / 2)] === 1 ? 0 : 1
        }
    }
    return A
};

console.log(flipAndInvertImage([[1, 1, 0, 0], [1, 0, 0, 1], [0, 1, 1, 1], [1, 0, 1, 0]]))//[[1,1,0,0],[0,1,1,0],[0,0,0,1],[1,0,1,0]]
console.log(flipAndInvertImage([[1,1,0],[1,0,1],[0,0,0]])) //[[1,0,0],[0,1,0],[1,1,1]]